УТ_для_edt/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартОписаниеЭтапа</name>
    <comment>//++ #1656 смарт: Фролов 27.02.2023 //Создание механизма отображения необходимых действий менеджером, на каждом этапе обработки Интереса.</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаКвалификацию</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаСогласованиеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеСчета</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаОплату</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_СостоянияИнтересов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоманднаяПанель.ТолькоПросмотр = Истина;
	
	Заголовок = НСтр("ru='Сценарий';en='Script'")+": "+Объект.Родитель.Наименование;
	
	Элементы.Используется.Видимость = НЕ ЗначениеЗаполнено(Объект.ВидСостояния);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПроверяемыеРеквизитыИнтереса = ТекущийОбъект.ПроверяемыеРеквизитыИнтереса.Получить();
	БлокируемыеРеквизитыИнтереса = ТекущийОбъект.БлокируемыеРеквизитыИнтереса.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПроверяемыеРеквизитыИнтереса <> Неопределено Тогда
		ТекущийОбъект.ПроверяемыеРеквизитыИнтереса = Новый ХранилищеЗначения(ПроверяемыеРеквизитыИнтереса);
	КонецЕсли;
	Если БлокируемыеРеквизитыИнтереса <> Неопределено Тогда
		ТекущийОбъект.БлокируемыеРеквизитыИнтереса = Новый ХранилищеЗначения(БлокируемыеРеквизитыИнтереса);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененоСостояниеИнтереса", Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияНастройкиНажатие(Элемент)
	Настройки = Новый  Структура;
	Настройки.Вставить("ПроверяемыеРеквизитыИнтереса", ПроверяемыеРеквизитыИнтереса);
	Настройки.Вставить("БлокируемыеРеквизитыИнтереса", БлокируемыеРеквизитыИнтереса);
	Настройки.Вставить("ОбязательноеПланированиеАктивности", Объект.ОбязательноеПланированиеАктивности);
	Настройки.Вставить("ИнтерактивноеПланированиеАктивностей", Объект.ИнтерактивноеПланированиеАктивностей);
	Настройки.Вставить("ЗавершатьЗапланированныеАктивности", Объект.ЗавершатьЗапланированныеАктивности);
	Настройки.Вставить("ОтборЗавершаемыхАктивностей", Объект.ОтборЗавершаемыхАктивностей);
	Настройки.Вставить("УказыватьДостигнутыйРезультат", Объект.УказыватьДостигнутыйРезультат);
	Настройки.Вставить("РазрешитьРолевуюАдресацию", Объект.РазрешитьРолевуюАдресацию);
	Настройки.Вставить("ВидСостояния", Объект.ВидСостояния);
	Настройки.Вставить("ДобавитьВероятностьВПредставлениеСостояния", Объект.ДобавитьВероятностьВПредставлениеСостояния);
	Настройки.Вставить("ВероятностьСделки", Объект.ВероятностьСделки);
	Настройки.Вставить("ИндексЦвета", Объект.ИндексЦвета);
	Настройки.Вставить("ЭтоНовыйОбъект", Объект.Ссылка.Пустая());
	Настройки.Вставить("Родитель", Объект.Родитель);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеРедактированияНастроек", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Настройки", Настройки);
	ОткрытьФорму("Справочник.CRM_СостоянияИнтересов.Форма.ФормаНастройкиСостояния", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ИндексЦветаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповещениеНовое = Новый ОписаниеОповещения("ЦветНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ТекущийЦвет", Объект.ИндексЦвета);
	ФормаВыбораЦвета = ОткрытьФорму("Справочник.CRM_Категории.Форма.ФормаВыбораЦвета", ПараметрыФормы, Элемент,,,,
		ОповещениеНовое, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры // ЦветНачалоВыбора()

&НаКлиенте
// Продолжение процедуры "ЦветНачалоВыбора"
//
Процедура ЦветНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ (Результат = Неопределено) И НЕ (Результат = КодВозвратаДиалога.Отмена) Тогда
		Объект.ИндексЦвета = Результат[0].Картинка;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Справка(Команда)
	ПерейтиПоНавигационнойСсылке(CRM_ОбщегоНазначенияСервер.ПолучитьСсылкуНаРазделСправки("НастройкаСценариевПродажи"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершениеРедактированияНастроек(Настройки, ДопПараметры) Экспорт
	
	Если Настройки<>Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, Настройки);
		ПроверяемыеРеквизитыИнтереса = Настройки.ПроверяемыеРеквизитыИнтереса;
		БлокируемыеРеквизитыИнтереса = Настройки.БлокируемыеРеквизитыИнтереса;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
